{
  "reviews": [
    {
      "Name": "Michelle Mott",
      "Date": "2019-02-15",
      "Comment": "These two are the best breeders myself, my fiancé and even my parents have worked with. Renee was in full contact with me throughout the buying experience and offered everything I asked for including documents, live videos and UpToDate vaccines. She even worked with us regarding payments and allowed us to see the dogs face to face before any commitment was made and even went above and beyond and let us come see them the first day I offered. My mother came with me and my son to pick out our puppy and they were both SOO sweet and very informative. My mother who has worked with numerous breeders was extremely impressed. Since buying the BEST frenchie we have ever had, she has continued to have contact with me and even checks in on him frequently. She has helped me with food choices, potty training and even when I have questions she responds the same day. I highly highly recommend them if you are looking into purchasing a French bulldog!"
    },
    {
      "Name": "Shirley Noyce",
      "Date": "2019-02-15",
      "Comment": "Renee was super accommodating being we were across the country from her. Constantly sending pictures and videos of our puppy. Even though she wasn’t feeling well she accepted us into her home where we met our baby, his mom and other siblings. Renee was super! We love our Nash Boi."
    },
    {
      "Name": "Yaritza Perez",
      "Date": "2019-02-10",
      "Comment": "Great breeders! I was very nervous about getting a dog from a different State (I'm from PR) and Renee made me feel at ease every step of the way. I could tell they took excellent care of the dogs even through her interactions with them in videos. I've had my puppy for two weeks now and we still chat about how well the puppy is doing, and she sends me tips on how to take care of her. I'm very thankful to both, Renee and James, my family is very happy!"
    },
    {
      "Name": "Edward Bauer",
      "Date": "2019-02-04",
      "Comment": "My daughter Carly got her French Bulldog Branco from Renee and James and couldn’t be happier! They were kind, personable, knowledgeable, and professional every step of the way. They even hand delivered her right to her NYC apartment. They continuously check up on how Branco is doing. I highly recommend!"
    },
    {
      "Name": "Olivia Bourke",
      "Date": "2019-01-25",
      "Comment": "Renee is very knowledgeable, friendly, honest and ethical when it comes to her pooches. She is incredibly kind to be still reaching out and asking about our Pickle; you can tell she really cares about each pup personally. I highly recommend Ethical Frenchie if you are looking for a positive experience. You will not be disappointed if you choose to get your next family member from them."
    },
    {
      "Name": "Tina Rice",
      "Date": "2019-01-08",
      "Comment": "We had a wonderful experience when we got out baby Coquina (CoCo for short). The price was fair, and they met us halfway and presented my new baby in a cute little dress and gave us some baby supplies too. It was obvious from the moment we met her that CoCo had been loved and spoiled since day 1. And CoCo is one healthy little girl, full of energy and sass. Perfect!"
    },
    {
      "Name": "Stephanie Stickney",
      "Date": "2019-01-04",
      "Comment": "Great breeder! You can tell they care for their frenchies so much.! Sweet couple. And are willing to work with anyone!"
    },
    {
      "Name": "Clark Woodard",
      "Date": "2019-01-03",
      "Comment": "I am the new mom to the most amazing puppy from Ethical Frenchie. Renee and James at Ethical Frenchie were awesome to work with. They really care about their puppies and have stayed in constant contact to make sure that I don't miss a beat as a new dog owner. I HIGHLY recommend their services and puppies."
    },
    {
      "Name": "Tara Tipton",
      "Date": "2018-12-21",
      "Comment": "My hubby and I purchased a sweet frenchie from Renee and James. We had an excellent experience. Renee was so helpful. She sent me multiple pictures and videos and answered all my questions. You can really tell they love and care for their animals. They want to make sure each baby goes to a loving home. I feel confident you’d be happy purchasing from Ethical Frenchie! We highly recommend!"
    },
    {
      "Name": "Tonnia Marcum",
      "Date": "2018-12-27",
      "Comment": "Wonderful experience purchasing ouir Gus from Ethical Frenchie."
    }
  ]
}